test/benchmarks/k6-nginx-report.txt
→    data_received..................: 73 MB  2.4 MB/s
→    data_sent......................: 258 kB 8.5 kB/s
→    http_req_blocked...............: avg=189.98µs min=1µs      med=3.2µs    max=42.9ms   p(90)=9.9µs    p(95)=15.5µs  
→    http_req_connecting............: avg=182.04µs min=0s       med=0s       max=42.85ms  p(90)=0s       p(95)=0s      
→    http_req_duration..............: avg=6.06ms   min=222.4µs  med=784.85µs max=200.6ms  p(90)=3.74ms   p(95)=5.63ms  
→      { expected_response:true }...: avg=6.06ms   min=222.4µs  med=784.85µs max=200.6ms  p(90)=3.74ms   p(95)=5.63ms  
→    http_req_failed................: 0.00%  ✓ 0         ✗ 3000 
→    http_req_receiving.............: avg=134.88µs min=17.1µs   med=69.5µs   max=6.14ms   p(90)=223.65µs p(95)=371.07µs
→    http_req_sending...............: avg=66.61µs  min=3.4µs    med=12.1µs   max=43.02ms  p(90)=53.8µs   p(95)=124µs   
→    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
→    http_req_waiting...............: avg=5.86ms   min=142.69µs med=684.4µs  max=200.47ms p(90)=3.39ms   p(95)=5.29ms  
→    http_reqs......................: 3000   98.978209/s
→    iteration_duration.............: avg=1s       min=1s       med=1s       max=1.24s    p(90)=1s       p(95)=1s      
→    iterations.....................: 3000   98.978209/s
→    vus............................: 100    min=100     max=100
→    vus_max........................: 100    min=100     max=100