test/benchmarks/k6-nginx-report.txt
→    data_received..................: 73 MB  2.4 MB/s
→    data_sent......................: 258 kB 8.5 kB/s
→    http_req_blocked...............: avg=264.29µs min=900ns   med=3.4µs    max=60.13ms  p(90)=9.9µs    p(95)=17.8µs  
→    http_req_connecting............: avg=235.72µs min=0s      med=0s       max=57.08ms  p(90)=0s       p(95)=0s      
→    http_req_duration..............: avg=6.08ms   min=190.7µs med=890.84µs max=200.31ms p(90)=3.04ms   p(95)=4.67ms  
→      { expected_response:true }...: avg=6.08ms   min=190.7µs med=890.84µs max=200.31ms p(90)=3.04ms   p(95)=4.67ms  
→    http_req_failed................: 0.00%  ✓ 0         ✗ 3000 
→    http_req_receiving.............: avg=159.89µs min=15µs    med=76.64µs  max=5.4ms    p(90)=328.52µs p(95)=547.37µs
→    http_req_sending...............: avg=116.5µs  min=3.4µs   med=13.15µs  max=59.01ms  p(90)=50.82µs  p(95)=121.54µs
→    http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
→    http_req_waiting...............: avg=5.8ms    min=138µs   med=775.65µs max=200.01ms p(90)=2.64ms   p(95)=3.93ms  
→    http_reqs......................: 3000   98.952393/s
→    iteration_duration.............: avg=1s       min=1s      med=1s       max=1.26s    p(90)=1s       p(95)=1s      
→    iterations.....................: 3000   98.952393/s
→    vus............................: 100    min=100     max=100
→    vus_max........................: 100    min=100     max=100