test/benchmarks/k6-nginx-report.txt
→    data_received..................: 73 MB  2.4 MB/s
→    data_sent......................: 258 kB 8.5 kB/s
→    http_req_blocked...............: avg=365.43µs min=1µs     med=3.2µs    max=74.36ms  p(90)=9.9µs    p(95)=14.7µs  
→    http_req_connecting............: avg=283.99µs min=0s      med=0s       max=74.28ms  p(90)=0s       p(95)=0s      
→    http_req_duration..............: avg=6.63ms   min=212.8µs med=755.8µs  max=245.32ms p(90)=2.63ms   p(95)=4.86ms  
→      { expected_response:true }...: avg=6.63ms   min=212.8µs med=755.8µs  max=245.32ms p(90)=2.63ms   p(95)=4.86ms  
→    http_req_failed................: 0.00%  ✓ 0         ✗ 3000 
→    http_req_receiving.............: avg=123.18µs min=18.2µs  med=69.2µs   max=3.72ms   p(90)=231.83µs p(95)=348.23µs
→    http_req_sending...............: avg=91.11µs  min=3.7µs   med=11.3µs   max=74.72ms  p(90)=47.11µs  p(95)=110.06µs
→    http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
→    http_req_waiting...............: avg=6.42ms   min=167.5µs med=656.75µs max=244.73ms p(90)=2.31ms   p(95)=4.39ms  
→    http_reqs......................: 3000   98.958936/s
→    iteration_duration.............: avg=1s       min=1s      med=1s       max=1.24s    p(90)=1s       p(95)=1s      
→    iterations.....................: 3000   98.958936/s
→    vus............................: 100    min=100     max=100
→    vus_max........................: 100    min=100     max=100