test/benchmarks/k6-ngss-report.txt
→    data_received..................: 74 MB  2.4 MB/s
→    data_sent......................: 258 kB 8.5 kB/s
→    http_req_blocked...............: avg=232.84µs min=1.1µs   med=4.1µs   max=44.74ms  p(90)=10.5µs   p(95)=15.4µs  
→    http_req_connecting............: avg=181.5µs  min=0s      med=0s      max=42.64ms  p(90)=0s       p(95)=0s      
→    http_req_duration..............: avg=10.09ms  min=334.6µs med=1.9ms   max=302.52ms p(90)=6.89ms   p(95)=16.15ms 
→      { expected_response:true }...: avg=10.09ms  min=334.6µs med=1.9ms   max=302.52ms p(90)=6.89ms   p(95)=16.15ms 
→    http_req_failed................: 0.00%  ✓ 0         ✗ 3000 
→    http_req_receiving.............: avg=150.96µs min=15.8µs  med=90µs    max=3.24ms   p(90)=296.92µs p(95)=454.91µs
→    http_req_sending...............: avg=61.08µs  min=3.9µs   med=15.85µs max=41.59ms  p(90)=49.01µs  p(95)=98.4µs  
→    http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
→    http_req_waiting...............: avg=9.87ms   min=284.8µs med=1.72ms  max=301.76ms p(90)=6.69ms   p(95)=15.92ms 
→    http_reqs......................: 3000   98.604993/s
→    iteration_duration.............: avg=1.01s    min=1s      med=1s      max=1.3s     p(90)=1s       p(95)=1.01s   
→    iterations.....................: 3000   98.604993/s
→    vus............................: 100    min=100     max=100
→    vus_max........................: 100    min=100     max=100