test/benchmarks/k6-ngss-report.txt
→    data_received..................: 74 MB  2.4 MB/s
→    data_sent......................: 258 kB 8.5 kB/s
→    http_req_blocked...............: avg=625.75µs min=1.2µs   med=3.6µs   max=78.29ms  p(90)=9.79µs   p(95)=14.91µs 
→    http_req_connecting............: avg=568.66µs min=0s      med=0s      max=78.23ms  p(90)=0s       p(95)=0s      
→    http_req_duration..............: avg=7.15ms   min=286.2µs med=1.25ms  max=240.72ms p(90)=4.48ms   p(95)=12.84ms 
→      { expected_response:true }...: avg=7.15ms   min=286.2µs med=1.25ms  max=240.72ms p(90)=4.48ms   p(95)=12.84ms 
→    http_req_failed................: 0.00%  ✓ 0         ✗ 3000 
→    http_req_receiving.............: avg=131.92µs min=18.2µs  med=83.6µs  max=7ms      p(90)=249.52µs p(95)=381.61µs
→    http_req_sending...............: avg=184.41µs min=3.6µs   med=11.95µs max=77.89ms  p(90)=40.5µs   p(95)=77.62µs 
→    http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
→    http_req_waiting...............: avg=6.84ms   min=248.4µs med=1.12ms  max=240.1ms  p(90)=4.05ms   p(95)=12.32ms 
→    http_reqs......................: 3000   98.908128/s
→    iteration_duration.............: avg=1s       min=1s      med=1s      max=1.24s    p(90)=1s       p(95)=1.01s   
→    iterations.....................: 3000   98.908128/s
→    vus............................: 100    min=100     max=100
→    vus_max........................: 100    min=100     max=100