test/benchmarks/k6-ngss-report.txt
→    data_received..................: 73 MB  2.4 MB/s
→    data_sent......................: 258 kB 8.5 kB/s
→    http_req_blocked...............: avg=473.54µs min=1.1µs    med=3.3µs   max=92.19ms  p(90)=9.1µs    p(95)=14µs    
→    http_req_connecting............: avg=341.18µs min=0s       med=0s      max=91.4ms   p(90)=0s       p(95)=0s      
→    http_req_duration..............: avg=7.8ms    min=303.59µs med=1.2ms   max=273.25ms p(90)=3.85ms   p(95)=7.39ms  
→      { expected_response:true }...: avg=7.8ms    min=303.59µs med=1.2ms   max=273.25ms p(90)=3.85ms   p(95)=7.39ms  
→    http_req_failed................: 0.00%  ✓ 0         ✗ 3000 
→    http_req_receiving.............: avg=174.5µs  min=15.3µs   med=72.59µs max=13.14ms  p(90)=363.11µs p(95)=650.03µs
→    http_req_sending...............: avg=123.08µs min=3.7µs    med=11.2µs  max=96.79ms  p(90)=39.19µs  p(95)=64.02µs 
→    http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s      
→    http_req_waiting...............: avg=7.5ms    min=255.8µs  med=1.02ms  max=272.84ms p(90)=3.49ms   p(95)=6.8ms   
→    http_reqs......................: 3000   98.813364/s
→    iteration_duration.............: avg=1s       min=1s       med=1s      max=1.28s    p(90)=1s       p(95)=1s      
→    iterations.....................: 3000   98.813364/s
→    vus............................: 100    min=100     max=100
→    vus_max........................: 100    min=100     max=100